In [806]:
# Create Code to import data from NIRF with scores

## Using Selenium

In [1]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd
from selenium.webdriver.chrome.service import Service

# Chrome Version
- Version 129.0.6668.71 (Official Build) (arm64)
- Latest ChromeDriver 114.0.5735.90
- chrome://settings/help
- https://developer.chrome.com/docs/chromedriver/downloads

In [2]:
import time

In [3]:
# Path to your ChromeDriver
cp2 = '/opt/homebrew/bin/chromedriver'  # Replace with the actual path to your chromedriver

??webdriver.chrome

In [4]:
#!pip install webdriver-manager
from webdriver_manager.chrome import ChromeDriverManager

In [812]:
# Open the NIRF rankings page
n24o = "https://www.nirfindia.org/Rankings/2024/OverallRanking.html"
n23o = "https://www.nirfindia.org/Rankings/2023/OverallRanking.html"
n22o = "https://www.nirfindia.org/Rankings/2022/OverallRanking.html"
n21o = "https://www.nirfindia.org/Rankings/2021/OverallRanking.html"
n20o = "https://www.nirfindia.org/Rankings/2020/OverallRanking.html"
n19o = "https://www.nirfindia.org/Rankings/2019/OverallRanking.html"
#n18o = "https://www.nirfindia.org/Rankings/2018/OverallRanking.html"
#n17o = "https://www.nirfindia.org/Rankings/2017/OverallRanking.html"
#n16o = "https://www.nirfindia.org/Rankings/2016/OverallRanking.html"

url = n20o; nData = 'n20o'
print(nData, url)

n20o https://www.nirfindia.org/Rankings/2020/OverallRanking.html

In [253]:
#University Rankings
n24u = "https://www.nirfindia.org/Rankings/2024/UniversityRanking.html"
n23u = "https://www.nirfindia.org/Rankings/2023/UniversityRanking.html"
n22u = "https://www.nirfindia.org/Rankings/2022/UniversityRanking.html"
n21u = "https://www.nirfindia.org/Rankings/2021/UniversityRanking.html"
n20u = "https://www.nirfindia.org/Rankings/2020/UniversityRanking.html"
#n20u = "https://www.nirfindia.org/Rankings/2020/UniversityRanking.html"
url = n20u; nData = 'n20u'
print(nData, url)

n20u https://www.nirfindia.org/Rankings/2020/UniversityRanking.html

In [254]:
cService = webdriver.ChromeService(executable_path='/opt/homebrew/bin/chromedriver')
driver = webdriver.Chrome(service = cService)

In [255]:
driver.get(url)
driver.maximize_window()

In [256]:
print(driver.title)

MoE, National Institute Ranking Framework (NIRF)

In [257]:
# Allow the page to load completely
time.sleep(5)  # Adjust time if needed, or you can use Selenium's explicit waits

In [258]:
data=[]
score=[]

In [259]:
button = driver.find_element(By.XPATH , value = '//a[@class="btn-more-details"]')
button.click()  #this worked

In [260]:
table1=driver.find_elements(by=By.XPATH, value='//div[@class="tbl_hidden"]//tbody//tr')

In [261]:
#table1
len(table1)  #100 univ data so 100 elements

100

In [262]:
length = len(table1)
for i in range(length):
    #print(i)
    score.append(table1[i].get_attribute('innerHTML'))
    #score.append(" ")

In [263]:
#score[0:10]
#this score of 100 orgs

In [264]:
df2 =pd.DataFrame(score)
df2.head(2)

                                                   0
0  <td>82.22</td><td>92.16</td><td>82.89</td><td>...
1  <td>74.98</td><td>44.80</td><td>100.00</td><td...

In [265]:
df2['A']=df2[0].apply(lambda x: x.replace('</td>',','))
#remove <td> and </td> from data

In [266]:
#df2.head(3)  #remove </td> and put a new col A

In [267]:
df2['A']=df2['A'].apply(lambda x: x.replace('<td>',''))

In [268]:
df2.head(2)  #remove <td> , now A col is correct, values delimited by ,

,0,A
0,<td>82.22</td><td>92.16</td><td>82.89</td><td>...,"82.22,92.16,82.89,52.84,100.00,"
1,<td>74.98</td><td>44.80</td><td>100.00</td><td...,"74.98,44.80,100.00,75.10,67.24,"

In [269]:
df2['A']=df2['A'].str.split(',')
#split the data delim by ,
#df2.head()

In [270]:
#df2.dtypes

In [271]:
df2B = df2['A'].apply(pd.Series)  # create a new DF df3 from series of Col A of df
df2B.columns = ['A', 'B','C','D','E','F']  # put values in different columns

In [272]:
df2B.head(2)

       A      B       C      D       E F
0  82.22  92.16   82.89  52.84  100.00
1  74.98  44.80  100.00  75.10   67.24

In [273]:
df2B.describe() # there is 1 value in col F

            A     B      C      D      E    F
count     100   100    100    100    100  100
unique     97    99     98     99     76    1
top     70.68  8.36  77.12  49.90  18.74
freq        2     2      2      2      4  100

In [274]:
df2B.F.unique()  #there is just a space in F col, check value in col F

array([''], dtype=object)

In [275]:
df2C = df2B.drop('F',axis=1)  # drop col F
#df2C.head()

In [276]:
#df3.to_clipboard(excel=True) # copy to clipboard if required

# restart of other values
time.sleep(3)
driver.quit()

# Inner values end here 
# Start with Outer Table Values

cService = webdriver.ChromeService(executable_path='/opt/homebrew/bin/chromedriver')
driver = webdriver.Chrome(service = cService)

In [277]:
print(url)

https://www.nirfindia.org/Rankings/2020/UniversityRanking.html

In [278]:
driver.get(url)
# Allow the page to load completely
time.sleep(5)  # Adjust time if needed, or you can use Selenium's explicit waits

In [279]:
# Locate the table on the page
table = driver.find_element(By.TAG_NAME, 'table')

In [280]:
table

In [281]:
# Extract table headers
headers = []
header_elements = table.find_elements(By.TAG_NAME, 'th')
for header in header_elements:
    headers.append(header.text.strip())

In [282]:
print(headers[0:6], headers[7:100])

['Institute ID', 'Name', 'City', 'State', 'Score', 'Rank'] ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '']

In [283]:
print(headers[0:6], ' Actual Count of Headers, some may be blank ', len(headers))

['Institute ID', 'Name', 'City', 'State', 'Score', 'Rank']  Actual Count of Headers, some may be blank  506

In [284]:
# Extract table rows
rows = []
row_elements = table.find_elements(By.TAG_NAME, 'tr')

In [285]:
#print(row_elements[0:5])

In [286]:
# Loop through rows to extract data
for row in row_elements[1:]:  # Skipping the header row
    cols = row.find_elements(By.TAG_NAME, 'td')
    cols = [col.text.strip() for col in cols]
    rows.append(cols)

In [287]:
#rows[0:3]
#1 row into 3 rows  : 2 & 3rd row are blanks

In [288]:
print(len(rows), len(headers))

300 506

In [289]:
print(headers[0:6])

['Institute ID', 'Name', 'City', 'State', 'Score', 'Rank']

In [290]:
print(rows[0])

['IR-O-U-0220', 'Indian Institute of Science\nMore Details | |', '', '', '', '', '', 'Bengaluru', 'Karnataka', '84.18', '1']

In [291]:
#print(rows[0:300:3])

In [292]:
# Create a DataFrame from the extracted data
df1 = pd.DataFrame(rows[0:300:3], columns=headers[0:11])

In [293]:
df1.head(2)

,Institute ID,Name,City,State,Score,Rank,,,,,
0,IR-O-U-0220,Indian Institute of Science\nMore Details | |,,,,,,Bengaluru,Karnataka,84.18,1
1,IR-O-U-0109,Jawaharlal Nehru University\nMore Details | |,,,,,,New Delhi,Delhi,70.16,2

In [294]:
list(df1.columns)

['Institute ID', 'Name', 'City', 'State', 'Score', 'Rank', '', '', '', '', '']

In [295]:
df1.columns = ['instituteID','name', 'C1','C2','C3','C4','C5','city','state','score','rank']

In [296]:
df1.head(2)

,instituteID,name,C1,C2,C3,C4,C5,city,state,score,rank
0,IR-O-U-0220,Indian Institute of Science\nMore Details | |,,,,,,Bengaluru,Karnataka,84.18,1
1,IR-O-U-0109,Jawaharlal Nehru University\nMore Details | |,,,,,,New Delhi,Delhi,70.16,2

In [297]:
df1B = df1.drop(columns= ['C1','C2','C3','C4','C5'])
df1B.head(2)

,instituteID,name,city,state,score,rank
0,IR-O-U-0220,Indian Institute of Science\nMore Details | |,Bengaluru,Karnataka,84.18,1
1,IR-O-U-0109,Jawaharlal Nehru University\nMore Details | |,New Delhi,Delhi,70.16,2

In [298]:
df1B.shape

(100, 6)

In [299]:
df1B.columns

Index(['instituteID', 'name', 'city', 'state', 'score', 'rank'], dtype='object')

In [300]:
df1B[['name','extra_col']]= df1B['name'].str.split("\n", n=1, expand=True)
df1B.drop('extra_col', axis=1, inplace=True)

-  df1B['name'].str.replace(r'\nMore Details | |', '', regex=True)

In [301]:
df1B.head(2)

   instituteID                         name       city      state  score rank
0  IR-O-U-0220  Indian Institute of Science  Bengaluru  Karnataka  84.18    1
1  IR-O-U-0109  Jawaharlal Nehru University  New Delhi      Delhi  70.16    2

In [302]:
df1B.shape

(100, 6)

In [303]:
df2C.shape

(100, 5)

In [304]:
df2C.columns = ['TLR','RPC','GO','OI','PR']
df2C.head(2)

     TLR    RPC      GO     OI      PR
0  82.22  92.16   82.89  52.84  100.00
1  74.98  44.80  100.00  75.10   67.24

In [305]:
dfNO = pd.concat([df1B.reset_index(drop=True), df2C], axis=1)
dfNO['nYear'] = nData

In [306]:
dfNO.head(2)

,instituteID,name,city,state,score,rank,TLR,RPC,GO,OI,PR,nYear
0,IR-O-U-0220,Indian Institute of Science,Bengaluru,Karnataka,84.18,1,82.22,92.16,82.89,52.84,100.00,n20u
1,IR-O-U-0109,Jawaharlal Nehru University,New Delhi,Delhi,70.16,2,74.98,44.80,100.00,75.10,67.24,n20u

In [307]:
# Close the browser
driver.quit()

In [308]:
# Display the extracted data
#print(dfNO)

In [309]:
# Save the data to a CSV file
fileLoc  = '/Users/du/dup/auData/ranking/nirf/'
fileName = fileLoc +  nData + '.csv'
print(nData, fileName)

n20u /Users/du/dup/auData/ranking/nirf/n20u.csv

In [310]:
dfNO.to_csv(fileName, index=False)

In [311]:
import os

In [312]:
print(' '.join(map(str, os.listdir(fileLoc))))

Innovation nirf22R.csv nirf22P.csv N23scores.pdf n24u.csv nirf2122P.csv .DS_Store IR2024_Report.pdf n21o.csv n22u.csv Law Management pdf NIRF 2023 Data Summary.pdf n23u.csv n20o.csv n20u.csv n23o.csv nirf24o.csv Architecture NIRFall.csv nirfAU.csv n22o.csv n21u.csv nirf21A.csv N23Scores.csv n2oo.csv n24o.csv Overall Engineering nirfScores.csv

## End of Coding

In [313]:
pd.read_csv(fileName).head(2)

,instituteID,name,city,state,score,rank,TLR,RPC,GO,OI,PR,nYear
0,IR-O-U-0220,Indian Institute of Science,Bengaluru,Karnataka,84.18,1,82.22,92.16,82.89,52.84,100.00,n20u
1,IR-O-U-0109,Jawaharlal Nehru University,New Delhi,Delhi,70.16,2,74.98,44.80,100.00,75.10,67.24,n20u